var APP_DATA = {
  "scenes": [
    {
      "id": "0---2",
      "name": "перед ліфтом 2",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -3.06038586011897,
        "pitch": 0.27854227801253373,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -3.1142159326825265,
          "pitch": 0.8624493907003821,
          "rotation": 0,
          "target": "2--2-"
        },
        {
          "yaw": -3.1325304382255084,
          "pitch": 0.16674169315723653,
          "rotation": 0,
          "target": "1--2"
        },
        {
          "yaw": 1.7388302970314324,
          "pitch": 0.7445691590219621,
          "rotation": 0,
          "target": "3-983"
        },
        {
          "yaw": 1.6407476188244825,
          "pitch": 0.2322345650012032,
          "rotation": 0,
          "target": "5-985"
        },
        {
          "yaw": -1.4926979974108576,
          "pitch": 0.48228585825772896,
          "rotation": 0,
          "target": "8-982"
        },
        {
          "yaw": -1.51416934738846,
          "pitch": 0.13904189599404582,
          "rotation": 0,
          "target": "10-979"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.0199348415035203,
          "pitch": -0.1975420948655735,
          "title": "983",
          "text": "смарт"
        },
        {
          "yaw": -1.2626667286524018,
          "pitch": -0.12874519235725757,
          "title": "982",
          "text": "смарт"
        }
      ]
    },
    {
      "id": "1--2",
      "name": "ліфт 2",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 3.06399160375965,
        "pitch": 0.17222493551289375,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -0.0022120010851001126,
          "pitch": 0.7984368185938582,
          "rotation": 0,
          "target": "2--2-"
        },
        {
          "yaw": -2.6851720965397217,
          "pitch": 0.48074273127502387,
          "rotation": 7.0685834705770345,
          "target": "3-983"
        },
        {
          "yaw": 2.802655511031846,
          "pitch": 0.47827294094583905,
          "rotation": 5.497787143782138,
          "target": "8-982"
        },
        {
          "yaw": -3.026809291904005,
          "pitch": 0.7310929383238935,
          "rotation": 0,
          "target": "0---2"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.5902919784863805,
          "pitch": 0.2579527700588926,
          "title": "пасажирський ліфт",
          "text": "на 6 персон"
        },
        {
          "yaw": -1.6060676029785803,
          "pitch": 0.16329804059318676,
          "title": "вантажний ліфт",
          "text": "великий"
        },
        {
          "yaw": -2.6889757056931884,
          "pitch": -0.0583852754684937,
          "title": "983",
          "text": "смарт"
        }
      ]
    },
    {
      "id": "2--2-",
      "name": "ліфт 2 (підлога)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 3.0920881738481825,
        "pitch": -0.16042849991884722,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -2.740017159590316,
          "pitch": 0.30034046520173163,
          "rotation": 7.0685834705770345,
          "target": "3-983"
        },
        {
          "yaw": 2.6398629429833296,
          "pitch": 0.2881361281394721,
          "rotation": 5.497787143782138,
          "target": "8-982"
        },
        {
          "yaw": 0.036968339958210805,
          "pitch": -0.5976209044402836,
          "rotation": 0,
          "target": "1--2"
        },
        {
          "yaw": 3.0984489203716405,
          "pitch": 0.3200136536946552,
          "rotation": 0,
          "target": "0---2"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.3663497311646022,
          "pitch": -0.30030797315330204,
          "title": "пасажирський ліфт",
          "text": "на 6 персон"
        },
        {
          "yaw": -2.7463263589121123,
          "pitch": -0.3612615631595215,
          "title": "983",
          "text": "смарт"
        },
        {
          "yaw": -1.5195959244273265,
          "pitch": -0.31206014668973125,
          "title": "вантажний ліфт",
          "text": "валикий"
        }
      ]
    },
    {
      "id": "3-983",
      "name": "983",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -0.14076489652224922,
        "pitch": 0.4321333839130972,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 3.0630620415123193,
          "pitch": 0.3141704063204429,
          "rotation": 0,
          "target": "8-982"
        },
        {
          "yaw": 0.009251660560106956,
          "pitch": 0.5940681237511871,
          "rotation": 0,
          "target": "4-984"
        },
        {
          "yaw": -0.0030130096966445308,
          "pitch": 0.30350388365644676,
          "rotation": 0,
          "target": "5-985"
        },
        {
          "yaw": 3.039652979796484,
          "pitch": 0.04395476194467385,
          "rotation": 4.71238898038469,
          "target": "11--"
        },
        {
          "yaw": 2.9174042783418823,
          "pitch": 0.762270082798862,
          "rotation": 4.71238898038469,
          "target": "0---2"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.5878841026713424,
          "pitch": -0.23421245483089947,
          "title": "983",
          "text": "смарт"
        },
        {
          "yaw": -0.35664566841227163,
          "pitch": -0.09186658787005797,
          "title": "984",
          "text": "смарт"
        },
        {
          "yaw": -3.050214524400946,
          "pitch": -0.05197081799249048,
          "title": "982",
          "text": "смарт"
        }
      ]
    },
    {
      "id": "4-984",
      "name": "984",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.00008581735032464621,
          "pitch": 0.3069122772572648,
          "rotation": 4.71238898038469,
          "target": "0---2"
        },
        {
          "yaw": 0.012662740168067899,
          "pitch": 0.5908461241623648,
          "rotation": 0,
          "target": "3-983"
        },
        {
          "yaw": -3.1242848580751286,
          "pitch": 0.49352996320997633,
          "rotation": 0,
          "target": "5-985"
        },
        {
          "yaw": -2.3038420235828116,
          "pitch": 0.6758578567279798,
          "rotation": 7.0685834705770345,
          "target": "6-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.4602366189179161,
          "pitch": -0.23139260096983172,
          "title": "984",
          "text": "смарт"
        },
        {
          "yaw": 0.3138140918527803,
          "pitch": -0.056971479886232856,
          "title": "983",
          "text": "смарт"
        },
        {
          "yaw": 2.8910103863290537,
          "pitch": -0.09757433729085285,
          "title": "985",
          "text": "смарт"
        },
        {
          "yaw": -3.0920978147505878,
          "pitch": -0.072512288181386,
          "title": "<span style=\"font-size: 13px; background-color: rgba(58, 68, 84, 0.8);\">986</span>",
          "text": "3 кімнатна"
        },
        {
          "yaw": -1.482802554665522,
          "pitch": 0.3528148296166602,
          "title": "пожежний гідрант",
          "text": "\"розбити скло\" (с)"
        }
      ]
    },
    {
      "id": "5-985",
      "name": "985",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": 0.09124028867841893,
          "pitch": 0.5524308390220263,
          "rotation": 0,
          "target": "4-984"
        },
        {
          "yaw": -0.927693273401001,
          "pitch": 0.6396011765921372,
          "rotation": 0,
          "target": "6-"
        },
        {
          "yaw": -1.0630455165808943,
          "pitch": 0.2519548900981512,
          "rotation": 10.995574287564278,
          "target": "7--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.782011352686073,
          "pitch": -0.03891559836263525,
          "title": "986",
          "text": "<span style=\"font-size: 16px; background-color: rgba(103, 115, 131, 0.8);\">3 кімнатна</span>"
        },
        {
          "yaw": 2.610216768855979,
          "pitch": -0.1915793384544564,
          "title": "985",
          "text": "смарт"
        },
        {
          "yaw": 0.3616689952159895,
          "pitch": -0.012298179621234695,
          "title": "984",
          "text": "смарт"
        },
        {
          "yaw": -2.03535009088853,
          "pitch": 0.4093620374786795,
          "title": "лічильники опалення",
          "text": "закрито на замок"
        },
        {
          "yaw": -0.9143132136418117,
          "pitch": -0.19623263453878437,
          "title": "батарея",
          "text": ""
        }
      ]
    },
    {
      "id": "6-",
      "name": "батарея",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.01216263885751978,
        "pitch": 0.004748587764090928,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -2.9922982149487485,
          "pitch": 0.5745300835944462,
          "rotation": 0,
          "target": "7--"
        },
        {
          "yaw": 0.3714744624906867,
          "pitch": 0.6087690043707124,
          "rotation": 7.0685834705770345,
          "target": "5-985"
        },
        {
          "yaw": -0.18692700675912555,
          "pitch": 0.6294317697284608,
          "rotation": 5.497787143782138,
          "target": "4-984"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.210297360815696,
          "pitch": -0.6884098387474396,
          "title": "батарея",
          "text": "зимове опалення"
        },
        {
          "yaw": -0.37757330780341647,
          "pitch": -0.026332260819659226,
          "title": "984",
          "text": "квартира"
        },
        {
          "yaw": 0.5327429370113865,
          "pitch": -0.03384457630461846,
          "title": "985",
          "text": "смарт"
        },
        {
          "yaw": 0.5581831246950202,
          "pitch": 0.4968948913320226,
          "title": "нога оператора",
          "text": "\"пасхалка\" :)"
        }
      ]
    },
    {
      "id": "7--",
      "name": "перед балконом",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 2.9917978428428587,
        "pitch": 0.19905482646720074,
        "fov": 1.349702217228306
      },
      "linkHotspots": [
        {
          "yaw": -0.10316145665716192,
          "pitch": 0.3269634219971209,
          "rotation": 0,
          "target": "6-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.869794452332524,
          "pitch": -0.01804471104011185,
          "title": "балкон",
          "text": "надворі ніч, тому так темно..."
        },
        {
          "yaw": -1.8776955018174384,
          "pitch": -0.018330234564460923,
          "title": "інженерне приміщення",
          "text": ""
        }
      ]
    },
    {
      "id": "8-982",
      "name": "982",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -3.1408410156136206,
          "pitch": 0.3506634126290802,
          "rotation": 0,
          "target": "3-983"
        },
        {
          "yaw": -2.848956571805436,
          "pitch": -0.010897318690716418,
          "rotation": 7.853981633974483,
          "target": "1--2"
        },
        {
          "yaw": -2.8546804229951697,
          "pitch": 0.37599922649726025,
          "rotation": 1.5707963267948966,
          "target": "2--2-"
        },
        {
          "yaw": -0.0028775597555981136,
          "pitch": 0.40391131570318883,
          "rotation": 0,
          "target": "9-980"
        },
        {
          "yaw": -0.11954103665337001,
          "pitch": 0.057451901350180634,
          "rotation": 4.71238898038469,
          "target": "11--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.4363223636724616,
          "pitch": -0.27575338677950434,
          "title": "982",
          "text": "смарт"
        },
        {
          "yaw": 2.9473177142190856,
          "pitch": -0.049526750882375126,
          "title": "983",
          "text": "смарт"
        },
        {
          "yaw": 0.26510068732705605,
          "pitch": -0.09935499225942834,
          "title": "981",
          "text": "смарт"
        }
      ]
    },
    {
      "id": "9-980",
      "name": "980",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -3.1018550967219056,
          "pitch": 0.3307188592089254,
          "rotation": 0,
          "target": "10-979"
        },
        {
          "yaw": 0.1496641262181253,
          "pitch": 0.4281518036087846,
          "rotation": 0,
          "target": "8-982"
        },
        {
          "yaw": 0.09640986347235447,
          "pitch": 0.19310473452015842,
          "rotation": 1.5707963267948966,
          "target": "0---2"
        },
        {
          "yaw": 2.789314571530559,
          "pitch": 0.31753750332867625,
          "rotation": 4.71238898038469,
          "target": "11--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.2831081044138557,
          "pitch": -0.16487047625248508,
          "title": "981",
          "text": "смарт"
        },
        {
          "yaw": -2.8513567634281145,
          "pitch": -0.07806024267988576,
          "title": "980",
          "text": "смарт"
        },
        {
          "yaw": -2.983213221075445,
          "pitch": -0.05191715056703394,
          "title": "<span style=\"font-size: 13px; background-color: rgba(58, 68, 84, 0.8);\">979</span>",
          "text": "смарт"
        },
        {
          "yaw": 3.1108411144667603,
          "pitch": -0.05389253274377026,
          "title": "978",
          "text": "2 кімнатна"
        },
        {
          "yaw": 2.747497289307721,
          "pitch": -0.06577775758956861,
          "title": "кнопка пожежної сигналізації",
          "text": "червона"
        }
      ]
    },
    {
      "id": "10-979",
      "name": "979",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.5713754177444539,
        "pitch": 0.18181532884489826,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 3.0973339021794075,
          "pitch": 0.4779993269635483,
          "rotation": 0,
          "target": "9-980"
        },
        {
          "yaw": -2.7175062576477664,
          "pitch": 0.3346054742513527,
          "rotation": 1.5707963267948966,
          "target": "11--"
        },
        {
          "yaw": 3.0930292793434955,
          "pitch": 0.1693496979417084,
          "rotation": 6.283185307179586,
          "target": "0---2"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.7201352807823973,
          "pitch": -0.3045900097319887,
          "title": "979",
          "text": "смарт"
        },
        {
          "yaw": -0.18618183448594827,
          "pitch": -0.15947794220775435,
          "title": "978",
          "text": "2 кімнатна"
        },
        {
          "yaw": -1.662583839298847,
          "pitch": -0.018586654217060072,
          "title": "977",
          "text": "3 кімнатна"
        },
        {
          "yaw": 2.5973229407274765,
          "pitch": -0.12687396094132275,
          "title": "980",
          "text": "смарт"
        }
      ]
    },
    {
      "id": "11--",
      "name": "пожежний хол",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -2.1537788031305354,
        "pitch": 0.3620146732114229,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 2.977188710056277,
          "pitch": 0.5171339590592634,
          "rotation": 5.497787143782138,
          "target": "10-979"
        },
        {
          "yaw": -2.8412649922402373,
          "pitch": 0.5286969881000694,
          "rotation": 7.0685834705770345,
          "target": "9-980"
        },
        {
          "yaw": -1.291682227006719,
          "pitch": 0.48712716093212194,
          "rotation": 1.5707963267948966,
          "target": "12--2"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -3.128752908078175,
          "pitch": -0.08119399006370998,
          "title": "979",
          "text": "смарт"
        },
        {
          "yaw": -1.471830012417609,
          "pitch": 0.15611946845483082,
          "title": "на 1 проверх",
          "text": "там евакуаційний вихід..."
        },
        {
          "yaw": -0.1578092580556376,
          "pitch": -0.6237598789545267,
          "title": "пожежна вентиляція",
          "text": "автоматична пожежна вентиляція"
        }
      ]
    },
    {
      "id": "12--2",
      "name": "сходи 2",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.7779381879770035,
          "pitch": 0.3235531823746314,
          "rotation": 0,
          "target": "11--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.30206897215272477,
          "pitch": -0.11224327461836836,
          "title": "на 3 поверх",
          "text": "на верх"
        },
        {
          "yaw": -0.08286489658807739,
          "pitch": 0.447817484491873,
          "title": "на 1 поверх",
          "text": "вних"
        }
      ]
    }
  ],
  "name": "Комфорт Таун, \"Змійка\" (2 поверх)",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": true,
    "fullscreenButton": true,
    "viewControlButtons": true
  }
};
